Framev2/app/controllers/contents_controller.rb

SELECT * FROM "contents"
---
  def index
    @contents = Content.all

SELECT * FROM "contents" WHERE ("contents"."id" = 0)
---
  def show
    @content = Content.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "contents" ("updated_at", "url", "watched", "user_id", "created_at", "thumbnail_url", "friend_id") VALUES('2010-06-02 18:19:41', 'vid1275502762', 'f', 3049, '2010-06-02 18:19:41', 'duh', 3049)
---
  def save
    @content = session[:content];
    @user = User.find(@content.user_id);
    @user.contents << @content;

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def new
  	@user = User.find(params[:id])

SELECT * FROM "contents" WHERE ("contents"."id" = 1)
---
  def edit
    @content = Content.find(params[:id])

SELECT * FROM "contents" WHERE ("contents"."id" = 0)
UPDATE "contents" SET "watched" = 't', "updated_at" = '2010-06-01 14:35:52' WHERE "id" = 1
---
  def watched
    @content = Content.find(params[:id])
    @content.watched = true;
    @content.save;

SELECT * FROM "contents" WHERE ("contents"."id" = 63)
UPDATE "contents" SET "thumbnail_url" = 'vid1275579695.jpg', "updated_at" = '2010-06-03 16:16:39' WHERE "id" = 63
---
  def update
    @content = Content.find(params[:id])

    respond_to do |format|
      if @content.update_attributes(params[:content])

SELECT * FROM "contents" WHERE ("contents"."id" = 1)
DELETE FROM "contents" WHERE "id" = 1
---
  def destroy
    @content = Content.find(params[:id])
    @content.destroy