Framev2/app/controllers/friends_controller.rb

SELECT * FROM "friends"
---
  def index
    @friends = Friend.all