Framev2/app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "contents" WHERE ("contents".user_id = 1)
---
  def menu
    @user = User.find(params[:id])
    @friend = Friend.find(session[:friend_id])
    @contents = @user.contents.find(:all, :offset => @user.contents.length - 3, :limit => 3)

INSERT INTO "users" ("name", "image_url", "updated_at", "dir", "created_at") VALUES('TestingUser', 'test', '2010-05-21 16:13:17', 'test', '2010-05-21 16:13:17')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "image_url" = 'http://t1.gstatic.com/images?q=tbn:2XRp19aQUDU3BM:http://www.vaughan.org/bios/wtk/HobbyHorseRider/images/big/lilburn.jpg', "updated_at" = '2010-05-31 20:50:07' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])